---
title: AutoRouteFailures
classe: Autodesk.Revit.DB.BuiltInFailures+AutoRouteFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 46
---

# AutoRouteFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AttemptToConnectNonSlopingElementToSlopedPipeError { get; }` | `AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeError` | FailureDefinitionId |
| `FailureDefinitionId AttemptToConnectNonSlopingElementToSlopedPipeWarning { get; }` | `AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeWarning` | FailureDefinitionId |
| `FailureDefinitionId DesignOptionConflictError { get; }` | `AutoRouteFailures.DesignOptionConflictError` | FailureDefinitionId |
| `FailureDefinitionId DesignOptionConflictWarning { get; }` | `AutoRouteFailures.DesignOptionConflictWarning` | FailureDefinitionId |
| `FailureDefinitionId DistributionTypeInvalid { get; }` | `AutoRouteFailures.DistributionTypeInvalid` | FailureDefinitionId |
| `FailureDefinitionId ElementHasFlowCalculation { get; }` | `AutoRouteFailures.ElementHasFlowCalculation` | FailureDefinitionId |
| `FailureDefinitionId ElementHasOpenConnection { get; }` | `AutoRouteFailures.ElementHasOpenConnection` | FailureDefinitionId |
| `FailureDefinitionId FailedDowngradeCrossToElbow { get; }` | `AutoRouteFailures.FailedDowngradeCrossToElbow` | FailureDefinitionId |
| `FailureDefinitionId FailedDowngradeCrossToTee { get; }` | `AutoRouteFailures.FailedDowngradeCrossToTee` | FailureDefinitionId |
| `FailureDefinitionId FailedDowngradeTeeToCross { get; }` | `AutoRouteFailures.FailedDowngradeTeeToCross` | FailureDefinitionId |
| `FailureDefinitionId FailToDoCompatiblePhaseError { get; }` | `AutoRouteFailures.FailToDoCompatiblePhaseError` | FailureDefinitionId |
| `FailureDefinitionId FailToDoCompatiblePhaseWarning { get; }` | `AutoRouteFailures.FailToDoCompatiblePhaseWarning` | FailureDefinitionId |
| `FailureDefinitionId FailToIntersectParallelSegmentsError { get; }` | `AutoRouteFailures.FailToIntersectParallelSegmentsError` | FailureDefinitionId |
| `FailureDefinitionId FailToIntersectParallelSegmentsWarning { get; }` | `AutoRouteFailures.FailToIntersectParallelSegmentsWarning` | FailureDefinitionId |
| `FailureDefinitionId FittingParamsCauseGeometryToFailError { get; }` | `AutoRouteFailures.FittingParamsCauseGeometryToFailError` | FailureDefinitionId |
| `FailureDefinitionId FittingParamsCauseGeometryToFailWarning { get; }` | `AutoRouteFailures.FittingParamsCauseGeometryToFailWarning` | FailureDefinitionId |
| `FailureDefinitionId HighlightedElementDisconnected { get; }` | `AutoRouteFailures.HighlightedElementDisconnected` | FailureDefinitionId |
| `FailureDefinitionId InappropriateSlopeForPipe { get; }` | `AutoRouteFailures.InappropriateSlopeForPipe` | FailureDefinitionId |
| `FailureDefinitionId MismatchedSystemClassificationHasSystemWarning { get; }` | `AutoRouteFailures.MismatchedSystemClassificationHasSystemWarning` | FailureDefinitionId |
| `FailureDefinitionId MismatchedSystemClassificationNoSystemWarning { get; }` | `AutoRouteFailures.MismatchedSystemClassificationNoSystemWarning` | FailureDefinitionId |
| `FailureDefinitionId MismatchedSystemTypeWarning { get; }` | `AutoRouteFailures.MismatchedSystemTypeWarning` | FailureDefinitionId |
| `FailureDefinitionId NoAutoRouteSolutionFoundError { get; }` | `AutoRouteFailures.NoAutoRouteSolutionFoundError` | FailureDefinitionId |
| `FailureDefinitionId NoAutoRouteSolutionFoundWarning { get; }` | `AutoRouteFailures.NoAutoRouteSolutionFoundWarning` | FailureDefinitionId |
| `FailureDefinitionId NoFittingInProjectError { get; }` | `AutoRouteFailures.NoFittingInProjectError` | FailureDefinitionId |
| `FailureDefinitionId NoFittingInProjectWarning { get; }` | `AutoRouteFailures.NoFittingInProjectWarning` | FailureDefinitionId |
| `FailureDefinitionId NoFittingInRoutingError { get; }` | `AutoRouteFailures.NoFittingInRoutingError` | FailureDefinitionId |
| `FailureDefinitionId NoFittingLoadedInProjectError { get; }` | `AutoRouteFailures.NoFittingLoadedInProjectError` | FailureDefinitionId |
| `FailureDefinitionId NoSolutionInView { get; }` | `AutoRouteFailures.NoSolutionInView` | FailureDefinitionId |
| `FailureDefinitionId NotAllPartsWereConvertedCannotAddPlaceholderWarning { get; }` | `AutoRouteFailures.NotAllPartsWereConvertedCannotAddPlaceholderWarning` | FailureDefinitionId |
| `FailureDefinitionId NotAllPartsWereConvertedPlaceholdersWereAddedWarning { get; }` | `AutoRouteFailures.NotAllPartsWereConvertedPlaceholdersWereAddedWarning` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughRoomForFittingsError { get; }` | `AutoRouteFailures.NotEnoughRoomForFittingsError` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughRoomForFittingsWarning { get; }` | `AutoRouteFailures.NotEnoughRoomForFittingsWarning` | FailureDefinitionId |
| `FailureDefinitionId NoValidSolutionAtSelectedPoint { get; }` | `AutoRouteFailures.NoValidSolutionAtSelectedPoint` | FailureDefinitionId |
| `FailureDefinitionId OverrideFabricationPartFailed { get; }` | `AutoRouteFailures.OverrideFabricationPartFailed` | FailureDefinitionId |
| `FailureDefinitionId SegmentDrawnFromWrongSideError { get; }` | `AutoRouteFailures.SegmentDrawnFromWrongSideError` | FailureDefinitionId |
| `FailureDefinitionId SegmentDrawnFromWrongSideWarning { get; }` | `AutoRouteFailures.SegmentDrawnFromWrongSideWarning` | FailureDefinitionId |
| `FailureDefinitionId SegmentsAngleTooGreatError { get; }` | `AutoRouteFailures.SegmentsAngleTooGreatError` | FailureDefinitionId |
| `FailureDefinitionId SegmentsAngleTooGreatWarning { get; }` | `AutoRouteFailures.SegmentsAngleTooGreatWarning` | FailureDefinitionId |
| `FailureDefinitionId SolutionIsOppositeToConnectionError { get; }` | `AutoRouteFailures.SolutionIsOppositeToConnectionError` | FailureDefinitionId |
| `FailureDefinitionId SolutionIsOppositeToConnectionWarning { get; }` | `AutoRouteFailures.SolutionIsOppositeToConnectionWarning` | FailureDefinitionId |
| `FailureDefinitionId SpecifiedAnglesNotCompatibleWithLayoutError { get; }` | `AutoRouteFailures.SpecifiedAnglesNotCompatibleWithLayoutError` | FailureDefinitionId |
| `FailureDefinitionId SpecifiedAnglesNotCompatibleWithLayoutWarning { get; }` | `AutoRouteFailures.SpecifiedAnglesNotCompatibleWithLayoutWarning` | FailureDefinitionId |
| `FailureDefinitionId UnableToMakeConnectionInDirection { get; }` | `AutoRouteFailures.UnableToMakeConnectionInDirection` | FailureDefinitionId |
| `FailureDefinitionId UtilizationCoefficientOutOfRange { get; }` | `AutoRouteFailures.UtilizationCoefficientOutOfRange` | FailureDefinitionId |
| `FailureDefinitionId ZeroLengthSegmentError { get; }` | `AutoRouteFailures.ZeroLengthSegmentError` | FailureDefinitionId |
| `FailureDefinitionId ZeroLengthSegmentWarning { get; }` | `AutoRouteFailures.ZeroLengthSegmentWarning` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```